# -*- org-confirm-babel-evaluate: nil; -*-

Orger converts your data into a hierarchical Org-mode representation to allow for quick access and search.

I write in detail about usecases and motivation for it [[https://beepb00p.xyz/orger.html][here]], this readme is mostly the setup manual!

* types of modules
- Mirror

  #+begin_src python :dir src :exports results :results drawer output
import orger
print(orger.Mirror.__doc__)
  #+end_src

  #+RESULTS:
  :results:

      *Mirror* (old name =StaticView=): mirrors *all data* from a source, and generated from scratch every time, hence *read only*.

  :end:

     You can run such module with

     : ./orger_module.py --to /path/to/output.org

- Queue

  #+BEGIN_SRC python :dir src :exports results :results drawer output
import orger
print(orger.Queue.__doc__)
  #+END_SRC

  #+RESULTS:
  :results:

      *Queue* (old name =InteractiveView=): works as a queue, *only previously unseen items* from the data source are added to the output org-mode file.

      To keep track of previously seen iteems, it's using a separate JSON =state= file.

      A typical usecase is a todo list, or a content processing queue.
      You can use such a module as you use any other org-mode file: schedule/refile/comment/set priorities, etc.

  :end:

   Typically you'd want to use these as a source of tasks for your todo list. See [[./modules/ip2org.py][ip2org]] as an example.

   You can run such a module as:

   : ./orger_module.py --to /path/to/output.org

   This will keep the state file in your user config dir (e.g. =~/.config/orger/=).

   Alternatively, you can pass the state file explicitly:

   : ./orger_module.py --to /path/to/output.org --state /path/to/state.json

